      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Divisiones.
       AUTHOR. David Ochoa
       INSTALLATION. www.
       DATE-WRITTEN.18/01/2023
       DATE-COMPILED.18/01/2023
       REMARKS.Programa creado para ver las divisiones

       ENVIRONMENT DIVISION.


       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM Divisiones.
